Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/pio/pic32cz2051ca70144.h
#define PIO_PC8A_EBI_NWE                           (_UINT32_(1) << 8) /**< EBI signal: EBI_NWE */
#define PIN_PC8A_EBI_NWR0                          _UINT32_(72) /**< EBI signal: EBI_NWR0 on PC8 mux A */
#define MUX_PC8A_EBI_NWR0                          _UINT32_(0)  /**< EBI signal line function value: EBI_NWR0 */
#define PIO_PC8A_EBI_NWR0                          (_UINT32_(1) << 8) /**< EBI signal: EBI_NWR0 */
#define PIN_PD15C_EBI_NWR1                         _UINT32_(111) /**< EBI signal: EBI_NWR1 on PD15 mux C */
#define MUX_PD15C_EBI_NWR1                         _UINT32_(2)  /**< EBI signal line function value: EBI_NWR1 */
#define PIO_PD15C_EBI_NWR1                         (_UINT32_(1) << 15) /**< EBI signal: EBI_NWR1 */
/* ========== PIO definition for EFC peripheral ========== */
#define PIN_PB12X1_EFC_ERASE                       _UINT32_(44) /**< EFC signal: EFC_ERASE on PB12 mux X1 */
#define PIO_PB12X1_EFC_ERASE                       (_UINT32_(1) << 12) /**< EFC signal: EFC_ERASE */
/* ========== PIO definition for GMAC peripheral ========== */
#define PIN_PD13A_GMAC_GCOL                        _UINT32_(109) /**< GMAC signal: GMAC_GCOL on PD13 mux A */
#define MUX_PD13A_GMAC_GCOL                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GCOL */
#define PIO_PD13A_GMAC_GCOL                        (_UINT32_(1) << 13) /**< GMAC signal: GMAC_GCOL */
#define PIN_PD10A_GMAC_GCRS                        _UINT32_(106) /**< GMAC signal: GMAC_GCRS on PD10 mux A */
#define MUX_PD10A_GMAC_GCRS                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GCRS */
#define PIO_PD10A_GMAC_GCRS                        (_UINT32_(1) << 10) /**< GMAC signal: GMAC_GCRS */
#define PIN_PD8A_GMAC_GMDC                         _UINT32_(104) /**< GMAC signal: GMAC_GMDC on PD8 mux A */
#define MUX_PD8A_GMAC_GMDC                         _UINT32_(0)  /**< GMAC signal line function value: GMAC_GMDC */
#define PIO_PD8A_GMAC_GMDC                         (_UINT32_(1) << 8) /**< GMAC signal: GMAC_GMDC */
#define PIN_PD9A_GMAC_GMDIO                        _UINT32_(105) /**< GMAC signal: GMAC_GMDIO on PD9 mux A */
#define MUX_PD9A_GMAC_GMDIO                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GMDIO */
#define PIO_PD9A_GMAC_GMDIO                        (_UINT32_(1) << 9) /**< GMAC signal: GMAC_GMDIO */
#define PIN_PD5A_GMAC_GRX0                         _UINT32_(101) /**< GMAC signal: GMAC_GRX0 on PD5 mux A */
#define MUX_PD5A_GMAC_GRX0                         _UINT32_(0)  /**< GMAC signal line function value: GMAC_GRX0 */
#define PIO_PD5A_GMAC_GRX0                         (_UINT32_(1) << 5) /**< GMAC signal: GMAC_GRX0 */
#define PIN_PD6A_GMAC_GRX1                         _UINT32_(102) /**< GMAC signal: GMAC_GRX1 on PD6 mux A */
#define MUX_PD6A_GMAC_GRX1                         _UINT32_(0)  /**< GMAC signal line function value: GMAC_GRX1 */
#define PIO_PD6A_GMAC_GRX1                         (_UINT32_(1) << 6) /**< GMAC signal: GMAC_GRX1 */
#define PIN_PD11A_GMAC_GRX2                        _UINT32_(107) /**< GMAC signal: GMAC_GRX2 on PD11 mux A */
#define MUX_PD11A_GMAC_GRX2                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GRX2 */
#define PIO_PD11A_GMAC_GRX2                        (_UINT32_(1) << 11) /**< GMAC signal: GMAC_GRX2 */
#define PIN_PD12A_GMAC_GRX3                        _UINT32_(108) /**< GMAC signal: GMAC_GRX3 on PD12 mux A */
#define MUX_PD12A_GMAC_GRX3                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GRX3 */
#define PIO_PD12A_GMAC_GRX3                        (_UINT32_(1) << 12) /**< GMAC signal: GMAC_GRX3 */
#define PIN_PD14A_GMAC_GRXCK                       _UINT32_(110) /**< GMAC signal: GMAC_GRXCK on PD14 mux A */
#define MUX_PD14A_GMAC_GRXCK                       _UINT32_(0)  /**< GMAC signal line function value: GMAC_GRXCK */
#define PIO_PD14A_GMAC_GRXCK                       (_UINT32_(1) << 14) /**< GMAC signal: GMAC_GRXCK */
#define PIN_PD4A_GMAC_GRXDV                        _UINT32_(100) /**< GMAC signal: GMAC_GRXDV on PD4 mux A */
#define MUX_PD4A_GMAC_GRXDV                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GRXDV */
#define PIO_PD4A_GMAC_GRXDV                        (_UINT32_(1) << 4) /**< GMAC signal: GMAC_GRXDV */
#define PIN_PD7A_GMAC_GRXER                        _UINT32_(103) /**< GMAC signal: GMAC_GRXER on PD7 mux A */
#define MUX_PD7A_GMAC_GRXER                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GRXER */
#define PIO_PD7A_GMAC_GRXER                        (_UINT32_(1) << 7) /**< GMAC signal: GMAC_GRXER */
#define PIN_PB1B_GMAC_GTSUCOMP                     _UINT32_(33) /**< GMAC signal: GMAC_GTSUCOMP on PB1 mux B */
#define MUX_PB1B_GMAC_GTSUCOMP                     _UINT32_(1)  /**< GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PB1B_GMAC_GTSUCOMP                     (_UINT32_(1) << 1) /**< GMAC signal: GMAC_GTSUCOMP */
#define PIN_PB12B_GMAC_GTSUCOMP                    _UINT32_(44) /**< GMAC signal: GMAC_GTSUCOMP on PB12 mux B */
#define MUX_PB12B_GMAC_GTSUCOMP                    _UINT32_(1)  /**< GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PB12B_GMAC_GTSUCOMP                    (_UINT32_(1) << 12) /**< GMAC signal: GMAC_GTSUCOMP */
#define PIN_PD11C_GMAC_GTSUCOMP                    _UINT32_(107) /**< GMAC signal: GMAC_GTSUCOMP on PD11 mux C */
#define MUX_PD11C_GMAC_GTSUCOMP                    _UINT32_(2)  /**< GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PD11C_GMAC_GTSUCOMP                    (_UINT32_(1) << 11) /**< GMAC signal: GMAC_GTSUCOMP */
#define PIN_PD20C_GMAC_GTSUCOMP                    _UINT32_(116) /**< GMAC signal: GMAC_GTSUCOMP on PD20 mux C */
#define MUX_PD20C_GMAC_GTSUCOMP                    _UINT32_(2)  /**< GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PD20C_GMAC_GTSUCOMP                    (_UINT32_(1) << 20) /**< GMAC signal: GMAC_GTSUCOMP */
#define PIN_PD2A_GMAC_GTX0                         _UINT32_(98) /**< GMAC signal: GMAC_GTX0 on PD2 mux A */
#define MUX_PD2A_GMAC_GTX0                         _UINT32_(0)  /**< GMAC signal line function value: GMAC_GTX0 */
#define PIO_PD2A_GMAC_GTX0                         (_UINT32_(1) << 2) /**< GMAC signal: GMAC_GTX0 */
#define PIN_PD3A_GMAC_GTX1                         _UINT32_(99) /**< GMAC signal: GMAC_GTX1 on PD3 mux A */
#define MUX_PD3A_GMAC_GTX1                         _UINT32_(0)  /**< GMAC signal line function value: GMAC_GTX1 */
#define PIO_PD3A_GMAC_GTX1                         (_UINT32_(1) << 3) /**< GMAC signal: GMAC_GTX1 */
#define PIN_PD15A_GMAC_GTX2                        _UINT32_(111) /**< GMAC signal: GMAC_GTX2 on PD15 mux A */
#define MUX_PD15A_GMAC_GTX2                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GTX2 */
#define PIO_PD15A_GMAC_GTX2                        (_UINT32_(1) << 15) /**< GMAC signal: GMAC_GTX2 */
#define PIN_PD16A_GMAC_GTX3                        _UINT32_(112) /**< GMAC signal: GMAC_GTX3 on PD16 mux A */
#define MUX_PD16A_GMAC_GTX3                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GTX3 */
#define PIO_PD16A_GMAC_GTX3                        (_UINT32_(1) << 16) /**< GMAC signal: GMAC_GTX3 */
#define PIN_PD0A_GMAC_GTXCK                        _UINT32_(96) /**< GMAC signal: GMAC_GTXCK on PD0 mux A */
#define MUX_PD0A_GMAC_GTXCK                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GTXCK */
#define PIO_PD0A_GMAC_GTXCK                        (_UINT32_(1) << 0) /**< GMAC signal: GMAC_GTXCK */
#define PIN_PD1A_GMAC_GTXEN                        _UINT32_(97) /**< GMAC signal: GMAC_GTXEN on PD1 mux A */
#define MUX_PD1A_GMAC_GTXEN                        _UINT32_(0)  /**< GMAC signal line function value: GMAC_GTXEN */
#define PIO_PD1A_GMAC_GTXEN                        (_UINT32_(1) << 1) /**< GMAC signal: GMAC_GTXEN */
#define PIN_PD17A_GMAC_GTXER                       _UINT32_(113) /**< GMAC signal: GMAC_GTXER on PD17 mux A */
#define MUX_PD17A_GMAC_GTXER                       _UINT32_(0)  /**< GMAC signal line function value: GMAC_GTXER */
#define PIO_PD17A_GMAC_GTXER                       (_UINT32_(1) << 17) /**< GMAC signal: GMAC_GTXER */
/* ========== PIO definition for HSMCI peripheral ========== */
#define PIN_PA28C_HSMCI_MCCDA                      _UINT32_(28) /**< HSMCI signal: HSMCI_MCCDA on PA28 mux C */
#define MUX_PA28C_HSMCI_MCCDA                      _UINT32_(2)  /**< HSMCI signal line function value: HSMCI_MCCDA */
#define PIO_PA28C_HSMCI_MCCDA                      (_UINT32_(1) << 28) /**< HSMCI signal: HSMCI_MCCDA */
#define PIN_PA25D_HSMCI_MCCK                       _UINT32_(25) /**< HSMCI signal: HSMCI_MCCK on PA25 mux D */
#define MUX_PA25D_HSMCI_MCCK                       _UINT32_(3)  /**< HSMCI signal line function value: HSMCI_MCCK */
#define PIO_PA25D_HSMCI_MCCK                       (_UINT32_(1) << 25) /**< HSMCI signal: HSMCI_MCCK */
#define PIN_PA30C_HSMCI_MCDA0                      _UINT32_(30) /**< HSMCI signal: HSMCI_MCDA0 on PA30 mux C */
#define MUX_PA30C_HSMCI_MCDA0                      _UINT32_(2)  /**< HSMCI signal line function value: HSMCI_MCDA0 */
#define PIO_PA30C_HSMCI_MCDA0                      (_UINT32_(1) << 30) /**< HSMCI signal: HSMCI_MCDA0 */
#define PIN_PA31C_HSMCI_MCDA1                      _UINT32_(31) /**< HSMCI signal: HSMCI_MCDA1 on PA31 mux C */
#define MUX_PA31C_HSMCI_MCDA1                      _UINT32_(2)  /**< HSMCI signal line function value: HSMCI_MCDA1 */
#define PIO_PA31C_HSMCI_MCDA1                      (_UINT32_(1) << 31) /**< HSMCI signal: HSMCI_MCDA1 */
#define PIN_PA26C_HSMCI_MCDA2                      _UINT32_(26) /**< HSMCI signal: HSMCI_MCDA2 on PA26 mux C */
#define MUX_PA26C_HSMCI_MCDA2                      _UINT32_(2)  /**< HSMCI signal line function value: HSMCI_MCDA2 */
#define PIO_PA26C_HSMCI_MCDA2                      (_UINT32_(1) << 26) /**< HSMCI signal: HSMCI_MCDA2 */
#define PIN_PA27C_HSMCI_MCDA3                      _UINT32_(27) /**< HSMCI signal: HSMCI_MCDA3 on PA27 mux C */
#define MUX_PA27C_HSMCI_MCDA3                      _UINT32_(2)  /**< HSMCI signal line function value: HSMCI_MCDA3 */
#define PIO_PA27C_HSMCI_MCDA3                      (_UINT32_(1) << 27) /**< HSMCI signal: HSMCI_MCDA3 */
/* ========== PIO definition for I2SC0 peripheral ========== */
#define PIN_PA1D_I2SC0_CK                          _UINT32_(1)  /**< I2SC0 signal: I2SC0_CK on PA1 mux D */
#define MUX_PA1D_I2SC0_CK                          _UINT32_(3)  /**< I2SC0 signal line function value: I2SC0_CK */
#define PIO_PA1D_I2SC0_CK                          (_UINT32_(1) << 1) /**< I2SC0 signal: I2SC0_CK */
#define PIN_PA16D_I2SC0_DI0                        _UINT32_(16) /**< I2SC0 signal: I2SC0_DI0 on PA16 mux D */
#define MUX_PA16D_I2SC0_DI0                        _UINT32_(3)  /**< I2SC0 signal line function value: I2SC0_DI0 */
#define PIO_PA16D_I2SC0_DI0                        (_UINT32_(1) << 16) /**< I2SC0 signal: I2SC0_DI0 */
#define PIN_PA30D_I2SC0_DO0                        _UINT32_(30) /**< I2SC0 signal: I2SC0_DO0 on PA30 mux D */
#define MUX_PA30D_I2SC0_DO0                        _UINT32_(3)  /**< I2SC0 signal line function value: I2SC0_DO0 */
#define PIO_PA30D_I2SC0_DO0                        (_UINT32_(1) << 30) /**< I2SC0 signal: I2SC0_DO0 */
#define PIN_PA0D_I2SC0_MCK                         _UINT32_(0)  /**< I2SC0 signal: I2SC0_MCK on PA0 mux D */
#define MUX_PA0D_I2SC0_MCK                         _UINT32_(3)  /**< I2SC0 signal line function value: I2SC0_MCK */
#define PIO_PA0D_I2SC0_MCK                         (_UINT32_(1) << 0) /**< I2SC0 signal: I2SC0_MCK */
#define PIN_PA15D_I2SC0_WS                         _UINT32_(15) /**< I2SC0 signal: I2SC0_WS on PA15 mux D */
#define MUX_PA15D_I2SC0_WS                         _UINT32_(3)  /**< I2SC0 signal line function value: I2SC0_WS */
#define PIO_PA15D_I2SC0_WS                         (_UINT32_(1) << 15) /**< I2SC0 signal: I2SC0_WS */
/* ========== PIO definition for I2SC1 peripheral ========== */
#define PIN_PA20D_I2SC1_CK                         _UINT32_(20) /**< I2SC1 signal: I2SC1_CK on PA20 mux D */
#define MUX_PA20D_I2SC1_CK                         _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_CK */
#define PIO_PA20D_I2SC1_CK                         (_UINT32_(1) << 20) /**< I2SC1 signal: I2SC1_CK */
#define PIN_PE2C_I2SC1_DI0                         _UINT32_(130) /**< I2SC1 signal: I2SC1_DI0 on PE2 mux C */
#define MUX_PE2C_I2SC1_DI0                         _UINT32_(2)  /**< I2SC1 signal line function value: I2SC1_DI0 */
#define PIO_PE2C_I2SC1_DI0                         (_UINT32_(1) << 2) /**< I2SC1 signal: I2SC1_DI0 */
#define PIN_PE1C_I2SC1_DO0                         _UINT32_(129) /**< I2SC1 signal: I2SC1_DO0 on PE1 mux C */
#define MUX_PE1C_I2SC1_DO0                         _UINT32_(2)  /**< I2SC1 signal line function value: I2SC1_DO0 */
#define PIO_PE1C_I2SC1_DO0                         (_UINT32_(1) << 1) /**< I2SC1 signal: I2SC1_DO0 */
#define PIN_PA19D_I2SC1_MCK                        _UINT32_(19) /**< I2SC1 signal: I2SC1_MCK on PA19 mux D */
#define MUX_PA19D_I2SC1_MCK                        _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_MCK */
#define PIO_PA19D_I2SC1_MCK                        (_UINT32_(1) << 19) /**< I2SC1 signal: I2SC1_MCK */
#define PIN_PE0C_I2SC1_WS                          _UINT32_(128) /**< I2SC1 signal: I2SC1_WS on PE0 mux C */
#define MUX_PE0C_I2SC1_WS                          _UINT32_(2)  /**< I2SC1 signal line function value: I2SC1_WS */
#define PIO_PE0C_I2SC1_WS                          (_UINT32_(1) << 0) /**< I2SC1 signal: I2SC1_WS */
/* ========== PIO definition for ISI peripheral ========== */
#define PIN_PD22D_ISI_D0                           _UINT32_(118) /**< ISI signal: ISI_D0 on PD22 mux D */
#define MUX_PD22D_ISI_D0                           _UINT32_(3)  /**< ISI signal line function value: ISI_D0 */
#define PIO_PD22D_ISI_D0                           (_UINT32_(1) << 22) /**< ISI signal: ISI_D0 */
#define PIN_PD21D_ISI_D1                           _UINT32_(117) /**< ISI signal: ISI_D1 on PD21 mux D */
#define MUX_PD21D_ISI_D1                           _UINT32_(3)  /**< ISI signal line function value: ISI_D1 */
#define PIO_PD21D_ISI_D1                           (_UINT32_(1) << 21) /**< ISI signal: ISI_D1 */
#define PIN_PB3D_ISI_D2                            _UINT32_(35) /**< ISI signal: ISI_D2 on PB3 mux D */
#define MUX_PB3D_ISI_D2                            _UINT32_(3)  /**< ISI signal line function value: ISI_D2 */
#define PIO_PB3D_ISI_D2                            (_UINT32_(1) << 3) /**< ISI signal: ISI_D2 */
#define PIN_PA9B_ISI_D3                            _UINT32_(9)  /**< ISI signal: ISI_D3 on PA9 mux B */
#define MUX_PA9B_ISI_D3                            _UINT32_(1)  /**< ISI signal line function value: ISI_D3 */
#define PIO_PA9B_ISI_D3                            (_UINT32_(1) << 9) /**< ISI signal: ISI_D3 */
#define PIN_PA5B_ISI_D4                            _UINT32_(5)  /**< ISI signal: ISI_D4 on PA5 mux B */
#define MUX_PA5B_ISI_D4                            _UINT32_(1)  /**< ISI signal line function value: ISI_D4 */
#define PIO_PA5B_ISI_D4                            (_UINT32_(1) << 5) /**< ISI signal: ISI_D4 */
#define PIN_PD11D_ISI_D5                           _UINT32_(107) /**< ISI signal: ISI_D5 on PD11 mux D */
#define MUX_PD11D_ISI_D5                           _UINT32_(3)  /**< ISI signal line function value: ISI_D5 */
#define PIO_PD11D_ISI_D5                           (_UINT32_(1) << 11) /**< ISI signal: ISI_D5 */
#define PIN_PD12D_ISI_D6                           _UINT32_(108) /**< ISI signal: ISI_D6 on PD12 mux D */
#define MUX_PD12D_ISI_D6                           _UINT32_(3)  /**< ISI signal line function value: ISI_D6 */
#define PIO_PD12D_ISI_D6                           (_UINT32_(1) << 12) /**< ISI signal: ISI_D6 */
#define PIN_PA27D_ISI_D7                           _UINT32_(27) /**< ISI signal: ISI_D7 on PA27 mux D */
#define MUX_PA27D_ISI_D7                           _UINT32_(3)  /**< ISI signal line function value: ISI_D7 */
#define PIO_PA27D_ISI_D7                           (_UINT32_(1) << 27) /**< ISI signal: ISI_D7 */
#define PIN_PD27D_ISI_D8                           _UINT32_(123) /**< ISI signal: ISI_D8 on PD27 mux D */
#define MUX_PD27D_ISI_D8                           _UINT32_(3)  /**< ISI signal line function value: ISI_D8 */
#define PIO_PD27D_ISI_D8                           (_UINT32_(1) << 27) /**< ISI signal: ISI_D8 */
#define PIN_PD28D_ISI_D9                           _UINT32_(124) /**< ISI signal: ISI_D9 on PD28 mux D */
#define MUX_PD28D_ISI_D9                           _UINT32_(3)  /**< ISI signal line function value: ISI_D9 */
#define PIO_PD28D_ISI_D9                           (_UINT32_(1) << 28) /**< ISI signal: ISI_D9 */
#define PIN_PD30D_ISI_D10                          _UINT32_(126) /**< ISI signal: ISI_D10 on PD30 mux D */
#define MUX_PD30D_ISI_D10                          _UINT32_(3)  /**< ISI signal line function value: ISI_D10 */
#define PIO_PD30D_ISI_D10                          (_UINT32_(1) << 30) /**< ISI signal: ISI_D10 */
#define PIN_PD31D_ISI_D11                          _UINT32_(127) /**< ISI signal: ISI_D11 on PD31 mux D */
#define MUX_PD31D_ISI_D11                          _UINT32_(3)  /**< ISI signal line function value: ISI_D11 */
#define PIO_PD31D_ISI_D11                          (_UINT32_(1) << 31) /**< ISI signal: ISI_D11 */
#define PIN_PD24D_ISI_HSYNC                        _UINT32_(120) /**< ISI signal: ISI_HSYNC on PD24 mux D */
#define MUX_PD24D_ISI_HSYNC                        _UINT32_(3)  /**< ISI signal line function value: ISI_HSYNC */
#define PIO_PD24D_ISI_HSYNC                        (_UINT32_(1) << 24) /**< ISI signal: ISI_HSYNC */
#define PIN_PA24D_ISI_PCK                          _UINT32_(24) /**< ISI signal: ISI_PCK on PA24 mux D */
#define MUX_PA24D_ISI_PCK                          _UINT32_(3)  /**< ISI signal line function value: ISI_PCK */
#define PIO_PA24D_ISI_PCK                          (_UINT32_(1) << 24) /**< ISI signal: ISI_PCK */
#define PIN_PD25D_ISI_VSYNC                        _UINT32_(121) /**< ISI signal: ISI_VSYNC on PD25 mux D */
#define MUX_PD25D_ISI_VSYNC                        _UINT32_(3)  /**< ISI signal line function value: ISI_VSYNC */
#define PIO_PD25D_ISI_VSYNC                        (_UINT32_(1) << 25) /**< ISI signal: ISI_VSYNC */
/* ========== PIO definition for MCAN0 peripheral ========== */
#define PIN_PB3A_MCAN0_CANRX0                      _UINT32_(35) /**< MCAN0 signal: MCAN0_CANRX0 on PB3 mux A */
#define MUX_PB3A_MCAN0_CANRX0                      _UINT32_(0)  /**< MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PB3A_MCAN0_CANRX0                      (_UINT32_(1) << 3) /**< MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PB2A_MCAN0_CANTX0                      _UINT32_(34) /**< MCAN0 signal: MCAN0_CANTX0 on PB2 mux A */
#define MUX_PB2A_MCAN0_CANTX0                      _UINT32_(0)  /**< MCAN0 signal line function value: MCAN0_CANTX0 */
#define PIO_PB2A_MCAN0_CANTX0                      (_UINT32_(1) << 2) /**< MCAN0 signal: MCAN0_CANTX0 */
/* ========== PIO definition for MCAN1 peripheral ========== */
#define PIN_PC12C_MCAN1_CANRX1                     _UINT32_(76) /**< MCAN1 signal: MCAN1_CANRX1 on PC12 mux C */
#define MUX_PC12C_MCAN1_CANRX1                     _UINT32_(2)  /**< MCAN1 signal line function value: MCAN1_CANRX1 */
#define PIO_PC12C_MCAN1_CANRX1                     (_UINT32_(1) << 12) /**< MCAN1 signal: MCAN1_CANRX1 */
#define PIN_PC14C_MCAN1_CANTX1                     _UINT32_(78) /**< MCAN1 signal: MCAN1_CANTX1 on PC14 mux C */
#define MUX_PC14C_MCAN1_CANTX1                     _UINT32_(2)  /**< MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PC14C_MCAN1_CANTX1                     (_UINT32_(1) << 14) /**< MCAN1 signal: MCAN1_CANTX1 */
#define PIN_PD12B_MCAN1_CANTX1                     _UINT32_(108) /**< MCAN1 signal: MCAN1_CANTX1 on PD12 mux B */
#define MUX_PD12B_MCAN1_CANTX1                     _UINT32_(1)  /**< MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PD12B_MCAN1_CANTX1                     (_UINT32_(1) << 12) /**< MCAN1 signal: MCAN1_CANTX1 */
/* ========== PIO definition for MLB peripheral ========== */
#define PIN_PB4C_MLB_MLBCLK                        _UINT32_(36) /**< MLB signal: MLB_MLBCLK on PB4 mux C */
#define MUX_PB4C_MLB_MLBCLK                        _UINT32_(2)  /**< MLB signal line function value: MLB_MLBCLK */
#define PIO_PB4C_MLB_MLBCLK                        (_UINT32_(1) << 4) /**< MLB signal: MLB_MLBCLK */
#define PIN_PB5C_MLB_MLBDAT                        _UINT32_(37) /**< MLB signal: MLB_MLBDAT on PB5 mux C */
#define MUX_PB5C_MLB_MLBDAT                        _UINT32_(2)  /**< MLB signal line function value: MLB_MLBDAT */
#define PIO_PB5C_MLB_MLBDAT                        (_UINT32_(1) << 5) /**< MLB signal: MLB_MLBDAT */
#define PIN_PD10D_MLB_MLBSIG                       _UINT32_(106) /**< MLB signal: MLB_MLBSIG on PD10 mux D */
#define MUX_PD10D_MLB_MLBSIG                       _UINT32_(3)  /**< MLB signal line function value: MLB_MLBSIG */
#define PIO_PD10D_MLB_MLBSIG                       (_UINT32_(1) << 10) /**< MLB signal: MLB_MLBSIG */
/* ========== PIO definition for PMC peripheral ========== */
#define PIN_PA6B_PMC_PCK0                          _UINT32_(6)  /**< PMC signal: PMC_PCK0 on PA6 mux B */
#define MUX_PA6B_PMC_PCK0                          _UINT32_(1)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PA6B_PMC_PCK0                          (_UINT32_(1) << 6) /**< PMC signal: PMC_PCK0 */
#define PIN_PB12D_PMC_PCK0                         _UINT32_(44) /**< PMC signal: PMC_PCK0 on PB12 mux D */
#define MUX_PB12D_PMC_PCK0                         _UINT32_(3)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PB12D_PMC_PCK0                         (_UINT32_(1) << 12) /**< PMC signal: PMC_PCK0 */
#define PIN_PB13B_PMC_PCK0                         _UINT32_(45) /**< PMC signal: PMC_PCK0 on PB13 mux B */
#define MUX_PB13B_PMC_PCK0                         _UINT32_(1)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PB13B_PMC_PCK0                         (_UINT32_(1) << 13) /**< PMC signal: PMC_PCK0 */
#define PIN_PA17B_PMC_PCK1                         _UINT32_(17) /**< PMC signal: PMC_PCK1 on PA17 mux B */
#define MUX_PA17B_PMC_PCK1                         _UINT32_(1)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PA17B_PMC_PCK1                         (_UINT32_(1) << 17) /**< PMC signal: PMC_PCK1 */
#define PIN_PA21B_PMC_PCK1                         _UINT32_(21) /**< PMC signal: PMC_PCK1 on PA21 mux B */
#define MUX_PA21B_PMC_PCK1                         _UINT32_(1)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PA21B_PMC_PCK1                         (_UINT32_(1) << 21) /**< PMC signal: PMC_PCK1 */
#define PIN_PA3C_PMC_PCK2                          _UINT32_(3)  /**< PMC signal: PMC_PCK2 on PA3 mux C */
#define MUX_PA3C_PMC_PCK2                          _UINT32_(2)  /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PA3C_PMC_PCK2                          (_UINT32_(1) << 3) /**< PMC signal: PMC_PCK2 */
#define PIN_PA18B_PMC_PCK2                         _UINT32_(18) /**< PMC signal: PMC_PCK2 on PA18 mux B */
#define MUX_PA18B_PMC_PCK2                         _UINT32_(1)  /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PA18B_PMC_PCK2                         (_UINT32_(1) << 18) /**< PMC signal: PMC_PCK2 */
#define PIN_PA31B_PMC_PCK2                         _UINT32_(31) /**< PMC signal: PMC_PCK2 on PA31 mux B */
#define MUX_PA31B_PMC_PCK2                         _UINT32_(1)  /**< PMC signal line function value: PMC_PCK2 */
