Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/pio/pic32cz2051ca70144.h
#define PIO_PD4B_PWM1_PWML2                        (_UINT32_(1) << 4) /**< PWM1 signal: PWM1_PWML2 */
#define PIN_PA5A_PWM1_PWML3                        _UINT32_(5)  /**< PWM1 signal: PWM1_PWML3 on PA5 mux A */
#define MUX_PA5A_PWM1_PWML3                        _UINT32_(0)  /**< PWM1 signal line function value: PWM1_PWML3 */
#define PIO_PA5A_PWM1_PWML3                        (_UINT32_(1) << 5) /**< PWM1 signal: PWM1_PWML3 */
#define PIN_PD6B_PWM1_PWML3                        _UINT32_(102) /**< PWM1 signal: PWM1_PWML3 on PD6 mux B */
#define MUX_PD6B_PWM1_PWML3                        _UINT32_(1)  /**< PWM1 signal line function value: PWM1_PWML3 */
#define PIO_PD6B_PWM1_PWML3                        (_UINT32_(1) << 6) /**< PWM1 signal: PWM1_PWML3 */
/* ========== PIO definition for QSPI peripheral ========== */
#define PIN_PA11A_QSPI_QCS                         _UINT32_(11) /**< QSPI signal: QSPI_QCS on PA11 mux A */
#define MUX_PA11A_QSPI_QCS                         _UINT32_(0)  /**< QSPI signal line function value: QSPI_QCS */
#define PIO_PA11A_QSPI_QCS                         (_UINT32_(1) << 11) /**< QSPI signal: QSPI_QCS */
#define PIN_PA13A_QSPI_QIO0                        _UINT32_(13) /**< QSPI signal: QSPI_QIO0 on PA13 mux A */
#define MUX_PA13A_QSPI_QIO0                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QIO0 */
#define PIO_PA13A_QSPI_QIO0                        (_UINT32_(1) << 13) /**< QSPI signal: QSPI_QIO0 */
#define PIN_PA12A_QSPI_QIO1                        _UINT32_(12) /**< QSPI signal: QSPI_QIO1 on PA12 mux A */
#define MUX_PA12A_QSPI_QIO1                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QIO1 */
#define PIO_PA12A_QSPI_QIO1                        (_UINT32_(1) << 12) /**< QSPI signal: QSPI_QIO1 */
#define PIN_PA17A_QSPI_QIO2                        _UINT32_(17) /**< QSPI signal: QSPI_QIO2 on PA17 mux A */
#define MUX_PA17A_QSPI_QIO2                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QIO2 */
#define PIO_PA17A_QSPI_QIO2                        (_UINT32_(1) << 17) /**< QSPI signal: QSPI_QIO2 */
#define PIN_PD31A_QSPI_QIO3                        _UINT32_(127) /**< QSPI signal: QSPI_QIO3 on PD31 mux A */
#define MUX_PD31A_QSPI_QIO3                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QIO3 */
#define PIO_PD31A_QSPI_QIO3                        (_UINT32_(1) << 31) /**< QSPI signal: QSPI_QIO3 */
#define PIN_PA14A_QSPI_QSCK                        _UINT32_(14) /**< QSPI signal: QSPI_QSCK on PA14 mux A */
#define MUX_PA14A_QSPI_QSCK                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QSCK */
#define PIO_PA14A_QSPI_QSCK                        (_UINT32_(1) << 14) /**< QSPI signal: QSPI_QSCK */
/* ========== PIO definition for RTC peripheral ========== */
#define PIN_PB0X1_RTC_RTCOUT0                      _UINT32_(32) /**< RTC signal: RTC_RTCOUT0 on PB0 mux X1 */
#define PIO_PB0X1_RTC_RTCOUT0                      (_UINT32_(1) << 0) /**< RTC signal: RTC_RTCOUT0 */
#define PIN_PB1X1_RTC_RTCOUT1                      _UINT32_(33) /**< RTC signal: RTC_RTCOUT1 on PB1 mux X1 */
#define PIO_PB1X1_RTC_RTCOUT1                      (_UINT32_(1) << 1) /**< RTC signal: RTC_RTCOUT1 */
/* ========== PIO definition for SPI0 peripheral ========== */
#define PIN_PD20B_SPI0_MISO                        _UINT32_(116) /**< SPI0 signal: SPI0_MISO on PD20 mux B */
#define MUX_PD20B_SPI0_MISO                        _UINT32_(1)  /**< SPI0 signal line function value: SPI0_MISO */
#define PIO_PD20B_SPI0_MISO                        (_UINT32_(1) << 20) /**< SPI0 signal: SPI0_MISO */
#define PIN_PD21B_SPI0_MOSI                        _UINT32_(117) /**< SPI0 signal: SPI0_MOSI on PD21 mux B */
#define MUX_PD21B_SPI0_MOSI                        _UINT32_(1)  /**< SPI0 signal line function value: SPI0_MOSI */
#define PIO_PD21B_SPI0_MOSI                        (_UINT32_(1) << 21) /**< SPI0 signal: SPI0_MOSI */
#define PIN_PB2D_SPI0_NPCS0                        _UINT32_(34) /**< SPI0 signal: SPI0_NPCS0 on PB2 mux D */
#define MUX_PB2D_SPI0_NPCS0                        _UINT32_(3)  /**< SPI0 signal line function value: SPI0_NPCS0 */
#define PIO_PB2D_SPI0_NPCS0                        (_UINT32_(1) << 2) /**< SPI0 signal: SPI0_NPCS0 */
#define PIN_PA31A_SPI0_NPCS1                       _UINT32_(31) /**< SPI0 signal: SPI0_NPCS1 on PA31 mux A */
#define MUX_PA31A_SPI0_NPCS1                       _UINT32_(0)  /**< SPI0 signal line function value: SPI0_NPCS1 */
#define PIO_PA31A_SPI0_NPCS1                       (_UINT32_(1) << 31) /**< SPI0 signal: SPI0_NPCS1 */
#define PIN_PD25B_SPI0_NPCS1                       _UINT32_(121) /**< SPI0 signal: SPI0_NPCS1 on PD25 mux B */
#define MUX_PD25B_SPI0_NPCS1                       _UINT32_(1)  /**< SPI0 signal line function value: SPI0_NPCS1 */
#define PIO_PD25B_SPI0_NPCS1                       (_UINT32_(1) << 25) /**< SPI0 signal: SPI0_NPCS1 */
#define PIN_PD12C_SPI0_NPCS2                       _UINT32_(108) /**< SPI0 signal: SPI0_NPCS2 on PD12 mux C */
#define MUX_PD12C_SPI0_NPCS2                       _UINT32_(2)  /**< SPI0 signal line function value: SPI0_NPCS2 */
#define PIO_PD12C_SPI0_NPCS2                       (_UINT32_(1) << 12) /**< SPI0 signal: SPI0_NPCS2 */
#define PIN_PD27B_SPI0_NPCS3                       _UINT32_(123) /**< SPI0 signal: SPI0_NPCS3 on PD27 mux B */
#define MUX_PD27B_SPI0_NPCS3                       _UINT32_(1)  /**< SPI0 signal line function value: SPI0_NPCS3 */
#define PIO_PD27B_SPI0_NPCS3                       (_UINT32_(1) << 27) /**< SPI0 signal: SPI0_NPCS3 */
#define PIN_PD22B_SPI0_SPCK                        _UINT32_(118) /**< SPI0 signal: SPI0_SPCK on PD22 mux B */
#define MUX_PD22B_SPI0_SPCK                        _UINT32_(1)  /**< SPI0 signal line function value: SPI0_SPCK */
#define PIO_PD22B_SPI0_SPCK                        (_UINT32_(1) << 22) /**< SPI0 signal: SPI0_SPCK */
/* ========== PIO definition for SPI1 peripheral ========== */
#define PIN_PC26C_SPI1_MISO                        _UINT32_(90) /**< SPI1 signal: SPI1_MISO on PC26 mux C */
#define MUX_PC26C_SPI1_MISO                        _UINT32_(2)  /**< SPI1 signal line function value: SPI1_MISO */
#define PIO_PC26C_SPI1_MISO                        (_UINT32_(1) << 26) /**< SPI1 signal: SPI1_MISO */
#define PIN_PC27C_SPI1_MOSI                        _UINT32_(91) /**< SPI1 signal: SPI1_MOSI on PC27 mux C */
#define MUX_PC27C_SPI1_MOSI                        _UINT32_(2)  /**< SPI1 signal line function value: SPI1_MOSI */
#define PIO_PC27C_SPI1_MOSI                        (_UINT32_(1) << 27) /**< SPI1 signal: SPI1_MOSI */
#define PIN_PC25C_SPI1_NPCS0                       _UINT32_(89) /**< SPI1 signal: SPI1_NPCS0 on PC25 mux C */
#define MUX_PC25C_SPI1_NPCS0                       _UINT32_(2)  /**< SPI1 signal line function value: SPI1_NPCS0 */
#define PIO_PC25C_SPI1_NPCS0                       (_UINT32_(1) << 25) /**< SPI1 signal: SPI1_NPCS0 */
#define PIN_PC28C_SPI1_NPCS1                       _UINT32_(92) /**< SPI1 signal: SPI1_NPCS1 on PC28 mux C */
#define MUX_PC28C_SPI1_NPCS1                       _UINT32_(2)  /**< SPI1 signal line function value: SPI1_NPCS1 */
#define PIO_PC28C_SPI1_NPCS1                       (_UINT32_(1) << 28) /**< SPI1 signal: SPI1_NPCS1 */
#define PIN_PD0C_SPI1_NPCS1                        _UINT32_(96) /**< SPI1 signal: SPI1_NPCS1 on PD0 mux C */
#define MUX_PD0C_SPI1_NPCS1                        _UINT32_(2)  /**< SPI1 signal line function value: SPI1_NPCS1 */
#define PIO_PD0C_SPI1_NPCS1                        (_UINT32_(1) << 0) /**< SPI1 signal: SPI1_NPCS1 */
#define PIN_PC29C_SPI1_NPCS2                       _UINT32_(93) /**< SPI1 signal: SPI1_NPCS2 on PC29 mux C */
#define MUX_PC29C_SPI1_NPCS2                       _UINT32_(2)  /**< SPI1 signal line function value: SPI1_NPCS2 */
#define PIO_PC29C_SPI1_NPCS2                       (_UINT32_(1) << 29) /**< SPI1 signal: SPI1_NPCS2 */
#define PIN_PD1C_SPI1_NPCS2                        _UINT32_(97) /**< SPI1 signal: SPI1_NPCS2 on PD1 mux C */
#define MUX_PD1C_SPI1_NPCS2                        _UINT32_(2)  /**< SPI1 signal line function value: SPI1_NPCS2 */
#define PIO_PD1C_SPI1_NPCS2                        (_UINT32_(1) << 1) /**< SPI1 signal: SPI1_NPCS2 */
#define PIN_PC30C_SPI1_NPCS3                       _UINT32_(94) /**< SPI1 signal: SPI1_NPCS3 on PC30 mux C */
#define MUX_PC30C_SPI1_NPCS3                       _UINT32_(2)  /**< SPI1 signal line function value: SPI1_NPCS3 */
#define PIO_PC30C_SPI1_NPCS3                       (_UINT32_(1) << 30) /**< SPI1 signal: SPI1_NPCS3 */
#define PIN_PD2C_SPI1_NPCS3                        _UINT32_(98) /**< SPI1 signal: SPI1_NPCS3 on PD2 mux C */
#define MUX_PD2C_SPI1_NPCS3                        _UINT32_(2)  /**< SPI1 signal line function value: SPI1_NPCS3 */
#define PIO_PD2C_SPI1_NPCS3                        (_UINT32_(1) << 2) /**< SPI1 signal: SPI1_NPCS3 */
#define PIN_PC24C_SPI1_SPCK                        _UINT32_(88) /**< SPI1 signal: SPI1_SPCK on PC24 mux C */
#define MUX_PC24C_SPI1_SPCK                        _UINT32_(2)  /**< SPI1 signal line function value: SPI1_SPCK */
#define PIO_PC24C_SPI1_SPCK                        (_UINT32_(1) << 24) /**< SPI1 signal: SPI1_SPCK */
/* ========== PIO definition for SSC peripheral ========== */
#define PIN_PA10C_SSC_RD                           _UINT32_(10) /**< SSC signal: SSC_RD on PA10 mux C */
#define MUX_PA10C_SSC_RD                           _UINT32_(2)  /**< SSC signal line function value: SSC_RD */
#define PIO_PA10C_SSC_RD                           (_UINT32_(1) << 10) /**< SSC signal: SSC_RD */
#define PIN_PD24B_SSC_RF                           _UINT32_(120) /**< SSC signal: SSC_RF on PD24 mux B */
#define MUX_PD24B_SSC_RF                           _UINT32_(1)  /**< SSC signal line function value: SSC_RF */
#define PIO_PD24B_SSC_RF                           (_UINT32_(1) << 24) /**< SSC signal: SSC_RF */
#define PIN_PA22A_SSC_RK                           _UINT32_(22) /**< SSC signal: SSC_RK on PA22 mux A */
#define MUX_PA22A_SSC_RK                           _UINT32_(0)  /**< SSC signal line function value: SSC_RK */
#define PIO_PA22A_SSC_RK                           (_UINT32_(1) << 22) /**< SSC signal: SSC_RK */
#define PIN_PB5D_SSC_TD                            _UINT32_(37) /**< SSC signal: SSC_TD on PB5 mux D */
#define MUX_PB5D_SSC_TD                            _UINT32_(3)  /**< SSC signal line function value: SSC_TD */
#define PIO_PB5D_SSC_TD                            (_UINT32_(1) << 5) /**< SSC signal: SSC_TD */
#define PIN_PD10C_SSC_TD                           _UINT32_(106) /**< SSC signal: SSC_TD on PD10 mux C */
#define MUX_PD10C_SSC_TD                           _UINT32_(2)  /**< SSC signal line function value: SSC_TD */
#define PIO_PD10C_SSC_TD                           (_UINT32_(1) << 10) /**< SSC signal: SSC_TD */
#define PIN_PD26B_SSC_TD                           _UINT32_(122) /**< SSC signal: SSC_TD on PD26 mux B */
#define MUX_PD26B_SSC_TD                           _UINT32_(1)  /**< SSC signal line function value: SSC_TD */
#define PIO_PD26B_SSC_TD                           (_UINT32_(1) << 26) /**< SSC signal: SSC_TD */
#define PIN_PB0D_SSC_TF                            _UINT32_(32) /**< SSC signal: SSC_TF on PB0 mux D */
#define MUX_PB0D_SSC_TF                            _UINT32_(3)  /**< SSC signal line function value: SSC_TF */
#define PIO_PB0D_SSC_TF                            (_UINT32_(1) << 0) /**< SSC signal: SSC_TF */
#define PIN_PB1D_SSC_TK                            _UINT32_(33) /**< SSC signal: SSC_TK on PB1 mux D */
#define MUX_PB1D_SSC_TK                            _UINT32_(3)  /**< SSC signal line function value: SSC_TK */
#define PIO_PB1D_SSC_TK                            (_UINT32_(1) << 1) /**< SSC signal: SSC_TK */
/* ========== PIO definition for SUPC peripheral ========== */
#define PIN_PA0X1_SUPC_WKUP0                       _UINT32_(0)  /**< SUPC signal: SUPC_WKUP0 on PA0 mux X1 */
#define PIO_PA0X1_SUPC_WKUP0                       (_UINT32_(1) << 0) /**< SUPC signal: SUPC_WKUP0 */
#define PIN_PA1X1_SUPC_WKUP1                       _UINT32_(1)  /**< SUPC signal: SUPC_WKUP1 on PA1 mux X1 */
#define PIO_PA1X1_SUPC_WKUP1                       (_UINT32_(1) << 1) /**< SUPC signal: SUPC_WKUP1 */
#define PIN_PA2X1_SUPC_WKUP2                       _UINT32_(2)  /**< SUPC signal: SUPC_WKUP2 on PA2 mux X1 */
#define PIO_PA2X1_SUPC_WKUP2                       (_UINT32_(1) << 2) /**< SUPC signal: SUPC_WKUP2 */
#define PIN_PA4X1_SUPC_WKUP3                       _UINT32_(4)  /**< SUPC signal: SUPC_WKUP3 on PA4 mux X1 */
#define PIO_PA4X1_SUPC_WKUP3                       (_UINT32_(1) << 4) /**< SUPC signal: SUPC_WKUP3 */
#define PIN_PA5X1_SUPC_WKUP4                       _UINT32_(5)  /**< SUPC signal: SUPC_WKUP4 on PA5 mux X1 */
#define PIO_PA5X1_SUPC_WKUP4                       (_UINT32_(1) << 5) /**< SUPC signal: SUPC_WKUP4 */
#define PIN_PD28X1_SUPC_WKUP5                      _UINT32_(124) /**< SUPC signal: SUPC_WKUP5 on PD28 mux X1 */
#define PIO_PD28X1_SUPC_WKUP5                      (_UINT32_(1) << 28) /**< SUPC signal: SUPC_WKUP5 */
#define PIN_PA9X1_SUPC_WKUP6                       _UINT32_(9)  /**< SUPC signal: SUPC_WKUP6 on PA9 mux X1 */
#define PIO_PA9X1_SUPC_WKUP6                       (_UINT32_(1) << 9) /**< SUPC signal: SUPC_WKUP6 */
#define PIN_PA11X1_SUPC_WKUP7                      _UINT32_(11) /**< SUPC signal: SUPC_WKUP7 on PA11 mux X1 */
#define PIO_PA11X1_SUPC_WKUP7                      (_UINT32_(1) << 11) /**< SUPC signal: SUPC_WKUP7 */
#define PIN_PA14X1_SUPC_WKUP8                      _UINT32_(14) /**< SUPC signal: SUPC_WKUP8 on PA14 mux X1 */
#define PIO_PA14X1_SUPC_WKUP8                      (_UINT32_(1) << 14) /**< SUPC signal: SUPC_WKUP8 */
#define PIN_PA19X1_SUPC_WKUP9                      _UINT32_(19) /**< SUPC signal: SUPC_WKUP9 on PA19 mux X1 */
#define PIO_PA19X1_SUPC_WKUP9                      (_UINT32_(1) << 19) /**< SUPC signal: SUPC_WKUP9 */
#define PIN_PA20X1_SUPC_WKUP10                     _UINT32_(20) /**< SUPC signal: SUPC_WKUP10 on PA20 mux X1 */
#define PIO_PA20X1_SUPC_WKUP10                     (_UINT32_(1) << 20) /**< SUPC signal: SUPC_WKUP10 */
#define PIN_PA30X1_SUPC_WKUP11                     _UINT32_(30) /**< SUPC signal: SUPC_WKUP11 on PA30 mux X1 */
#define PIO_PA30X1_SUPC_WKUP11                     (_UINT32_(1) << 30) /**< SUPC signal: SUPC_WKUP11 */
#define PIN_PB3X1_SUPC_WKUP12                      _UINT32_(35) /**< SUPC signal: SUPC_WKUP12 on PB3 mux X1 */
#define PIO_PB3X1_SUPC_WKUP12                      (_UINT32_(1) << 3) /**< SUPC signal: SUPC_WKUP12 */
#define PIN_PB5X1_SUPC_WKUP13                      _UINT32_(37) /**< SUPC signal: SUPC_WKUP13 on PB5 mux X1 */
#define PIO_PB5X1_SUPC_WKUP13                      (_UINT32_(1) << 5) /**< SUPC signal: SUPC_WKUP13 */
/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PA4B_TC0_TCLK0                         _UINT32_(4)  /**< TC0 signal: TC0_TCLK0 on PA4 mux B */
#define MUX_PA4B_TC0_TCLK0                         _UINT32_(1)  /**< TC0 signal line function value: TC0_TCLK0 */
#define PIO_PA4B_TC0_TCLK0                         (_UINT32_(1) << 4) /**< TC0 signal: TC0_TCLK0 */
#define PIN_PA28B_TC0_TCLK1                        _UINT32_(28) /**< TC0 signal: TC0_TCLK1 on PA28 mux B */
#define MUX_PA28B_TC0_TCLK1                        _UINT32_(1)  /**< TC0 signal line function value: TC0_TCLK1 */
#define PIO_PA28B_TC0_TCLK1                        (_UINT32_(1) << 28) /**< TC0 signal: TC0_TCLK1 */
#define PIN_PA29B_TC0_TCLK2                        _UINT32_(29) /**< TC0 signal: TC0_TCLK2 on PA29 mux B */
#define MUX_PA29B_TC0_TCLK2                        _UINT32_(1)  /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PA29B_TC0_TCLK2                        (_UINT32_(1) << 29) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PA0B_TC0_TIOA0                         _UINT32_(0)  /**< TC0 signal: TC0_TIOA0 on PA0 mux B */
#define MUX_PA0B_TC0_TIOA0                         _UINT32_(1)  /**< TC0 signal line function value: TC0_TIOA0 */
#define PIO_PA0B_TC0_TIOA0                         (_UINT32_(1) << 0) /**< TC0 signal: TC0_TIOA0 */
#define PIN_PA15B_TC0_TIOA1                        _UINT32_(15) /**< TC0 signal: TC0_TIOA1 on PA15 mux B */
#define MUX_PA15B_TC0_TIOA1                        _UINT32_(1)  /**< TC0 signal line function value: TC0_TIOA1 */
#define PIO_PA15B_TC0_TIOA1                        (_UINT32_(1) << 15) /**< TC0 signal: TC0_TIOA1 */
#define PIN_PA26B_TC0_TIOA2                        _UINT32_(26) /**< TC0 signal: TC0_TIOA2 on PA26 mux B */
#define MUX_PA26B_TC0_TIOA2                        _UINT32_(1)  /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PA26B_TC0_TIOA2                        (_UINT32_(1) << 26) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PA1B_TC0_TIOB0                         _UINT32_(1)  /**< TC0 signal: TC0_TIOB0 on PA1 mux B */
#define MUX_PA1B_TC0_TIOB0                         _UINT32_(1)  /**< TC0 signal line function value: TC0_TIOB0 */
#define PIO_PA1B_TC0_TIOB0                         (_UINT32_(1) << 1) /**< TC0 signal: TC0_TIOB0 */
#define PIN_PA16B_TC0_TIOB1                        _UINT32_(16) /**< TC0 signal: TC0_TIOB1 on PA16 mux B */
#define MUX_PA16B_TC0_TIOB1                        _UINT32_(1)  /**< TC0 signal line function value: TC0_TIOB1 */
#define PIO_PA16B_TC0_TIOB1                        (_UINT32_(1) << 16) /**< TC0 signal: TC0_TIOB1 */
#define PIN_PA27B_TC0_TIOB2                        _UINT32_(27) /**< TC0 signal: TC0_TIOB2 on PA27 mux B */
#define MUX_PA27B_TC0_TIOB2                        _UINT32_(1)  /**< TC0 signal line function value: TC0_TIOB2 */
#define PIO_PA27B_TC0_TIOB2                        (_UINT32_(1) << 27) /**< TC0 signal: TC0_TIOB2 */
/* ========== PIO definition for TC1 peripheral ========== */
#define PIN_PC25B_TC1_TCLK3                        _UINT32_(89) /**< TC1 signal: TC1_TCLK3 on PC25 mux B */
#define MUX_PC25B_TC1_TCLK3                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TCLK3 */
#define PIO_PC25B_TC1_TCLK3                        (_UINT32_(1) << 25) /**< TC1 signal: TC1_TCLK3 */
#define PIN_PC28B_TC1_TCLK4                        _UINT32_(92) /**< TC1 signal: TC1_TCLK4 on PC28 mux B */
#define MUX_PC28B_TC1_TCLK4                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TCLK4 */
#define PIO_PC28B_TC1_TCLK4                        (_UINT32_(1) << 28) /**< TC1 signal: TC1_TCLK4 */
#define PIN_PC31B_TC1_TCLK5                        _UINT32_(95) /**< TC1 signal: TC1_TCLK5 on PC31 mux B */
#define MUX_PC31B_TC1_TCLK5                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TCLK5 */
#define PIO_PC31B_TC1_TCLK5                        (_UINT32_(1) << 31) /**< TC1 signal: TC1_TCLK5 */
#define PIN_PC23B_TC1_TIOA3                        _UINT32_(87) /**< TC1 signal: TC1_TIOA3 on PC23 mux B */
#define MUX_PC23B_TC1_TIOA3                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TIOA3 */
#define PIO_PC23B_TC1_TIOA3                        (_UINT32_(1) << 23) /**< TC1 signal: TC1_TIOA3 */
#define PIN_PC26B_TC1_TIOA4                        _UINT32_(90) /**< TC1 signal: TC1_TIOA4 on PC26 mux B */
#define MUX_PC26B_TC1_TIOA4                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TIOA4 */
#define PIO_PC26B_TC1_TIOA4                        (_UINT32_(1) << 26) /**< TC1 signal: TC1_TIOA4 */
#define PIN_PC29B_TC1_TIOA5                        _UINT32_(93) /**< TC1 signal: TC1_TIOA5 on PC29 mux B */
#define MUX_PC29B_TC1_TIOA5                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TIOA5 */
#define PIO_PC29B_TC1_TIOA5                        (_UINT32_(1) << 29) /**< TC1 signal: TC1_TIOA5 */
#define PIN_PC24B_TC1_TIOB3                        _UINT32_(88) /**< TC1 signal: TC1_TIOB3 on PC24 mux B */
#define MUX_PC24B_TC1_TIOB3                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TIOB3 */
#define PIO_PC24B_TC1_TIOB3                        (_UINT32_(1) << 24) /**< TC1 signal: TC1_TIOB3 */
#define PIN_PC27B_TC1_TIOB4                        _UINT32_(91) /**< TC1 signal: TC1_TIOB4 on PC27 mux B */
#define MUX_PC27B_TC1_TIOB4                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TIOB4 */
#define PIO_PC27B_TC1_TIOB4                        (_UINT32_(1) << 27) /**< TC1 signal: TC1_TIOB4 */
#define PIN_PC30B_TC1_TIOB5                        _UINT32_(94) /**< TC1 signal: TC1_TIOB5 on PC30 mux B */
#define MUX_PC30B_TC1_TIOB5                        _UINT32_(1)  /**< TC1 signal line function value: TC1_TIOB5 */
#define PIO_PC30B_TC1_TIOB5                        (_UINT32_(1) << 30) /**< TC1 signal: TC1_TIOB5 */
/* ========== PIO definition for TC2 peripheral ========== */
#define PIN_PC7B_TC2_TCLK6                         _UINT32_(71) /**< TC2 signal: TC2_TCLK6 on PC7 mux B */
#define MUX_PC7B_TC2_TCLK6                         _UINT32_(1)  /**< TC2 signal line function value: TC2_TCLK6 */
#define PIO_PC7B_TC2_TCLK6                         (_UINT32_(1) << 7) /**< TC2 signal: TC2_TCLK6 */
#define PIN_PC10B_TC2_TCLK7                        _UINT32_(74) /**< TC2 signal: TC2_TCLK7 on PC10 mux B */
#define MUX_PC10B_TC2_TCLK7                        _UINT32_(1)  /**< TC2 signal line function value: TC2_TCLK7 */
#define PIO_PC10B_TC2_TCLK7                        (_UINT32_(1) << 10) /**< TC2 signal: TC2_TCLK7 */
#define PIN_PC14B_TC2_TCLK8                        _UINT32_(78) /**< TC2 signal: TC2_TCLK8 on PC14 mux B */
#define MUX_PC14B_TC2_TCLK8                        _UINT32_(1)  /**< TC2 signal line function value: TC2_TCLK8 */
#define PIO_PC14B_TC2_TCLK8                        (_UINT32_(1) << 14) /**< TC2 signal: TC2_TCLK8 */
#define PIN_PC5B_TC2_TIOA6                         _UINT32_(69) /**< TC2 signal: TC2_TIOA6 on PC5 mux B */
#define MUX_PC5B_TC2_TIOA6                         _UINT32_(1)  /**< TC2 signal line function value: TC2_TIOA6 */
#define PIO_PC5B_TC2_TIOA6                         (_UINT32_(1) << 5) /**< TC2 signal: TC2_TIOA6 */
#define PIN_PC8B_TC2_TIOA7                         _UINT32_(72) /**< TC2 signal: TC2_TIOA7 on PC8 mux B */
#define MUX_PC8B_TC2_TIOA7                         _UINT32_(1)  /**< TC2 signal line function value: TC2_TIOA7 */
#define PIO_PC8B_TC2_TIOA7                         (_UINT32_(1) << 8) /**< TC2 signal: TC2_TIOA7 */
#define PIN_PC11B_TC2_TIOA8                        _UINT32_(75) /**< TC2 signal: TC2_TIOA8 on PC11 mux B */
#define MUX_PC11B_TC2_TIOA8                        _UINT32_(1)  /**< TC2 signal line function value: TC2_TIOA8 */
#define PIO_PC11B_TC2_TIOA8                        (_UINT32_(1) << 11) /**< TC2 signal: TC2_TIOA8 */
#define PIN_PC6B_TC2_TIOB6                         _UINT32_(70) /**< TC2 signal: TC2_TIOB6 on PC6 mux B */
#define MUX_PC6B_TC2_TIOB6                         _UINT32_(1)  /**< TC2 signal line function value: TC2_TIOB6 */
#define PIO_PC6B_TC2_TIOB6                         (_UINT32_(1) << 6) /**< TC2 signal: TC2_TIOB6 */
#define PIN_PC9B_TC2_TIOB7                         _UINT32_(73) /**< TC2 signal: TC2_TIOB7 on PC9 mux B */
#define MUX_PC9B_TC2_TIOB7                         _UINT32_(1)  /**< TC2 signal line function value: TC2_TIOB7 */
#define PIO_PC9B_TC2_TIOB7                         (_UINT32_(1) << 9) /**< TC2 signal: TC2_TIOB7 */
#define PIN_PC12B_TC2_TIOB8                        _UINT32_(76) /**< TC2 signal: TC2_TIOB8 on PC12 mux B */
#define MUX_PC12B_TC2_TIOB8                        _UINT32_(1)  /**< TC2 signal line function value: TC2_TIOB8 */
#define PIO_PC12B_TC2_TIOB8                        (_UINT32_(1) << 12) /**< TC2 signal: TC2_TIOB8 */
/* ========== PIO definition for TC3 peripheral ========== */
#define PIN_PE2B_TC3_TCLK9                         _UINT32_(130) /**< TC3 signal: TC3_TCLK9 on PE2 mux B */
